Repository: eduardopahl/h2o_simple
Catalog: lib/l10n/app_*.arb
Languages: pt

# welcomeTitle
source: Welcome to H2OSync!
pt: Bem-vindo ao H2OSync!

# letsPersonalize
source: Let's customize your experience!
pt: Vamos personalizar sua experiência!

# helpYouStayHydrated
source: To help you maintain healthy hydration, let's configure:
pt: Para ajudá-lo a manter uma hidratação saudável, vamos configurar:

source: Personalized goal
pt: Meta personalizada

# basedOnWeightAge
source: Based on your weight, age and activity level
pt: Baseada em seu peso, idade e nível de atividade

source: Smart reminders
pt: Lembretes inteligentes

# notificationsToKeepHydrated
source: Notifications to keep you hydrated
pt: Notificações para manter você hidratado

source: Tracking
pt: Acompanhamento

# monitorDailyProgress
source: Monitor your daily progress
pt: Monitore seu progresso diário

source: Personal Data
pt: Dados pessoais

# toCalculateIdealGoal
source: To calculate your ideal hydration goal
pt: Para calcular sua meta de hidratação ideal

source: Weight (kg)
pt: Peso (kg)

source: Age
pt: Idade

source: years
pt: anos

source: Gender
pt: Gênero

source: Male
pt: Masculino

source: Female
pt: Feminino

source: Activity level
pt: Nível de atividade

source: Sedentary
pt: Sedentário

# light
source: Light (1-3x/week)
pt: Leve (1-3x/semana)

# moderate
source: Moderate (3-5x/week)
pt: Moderado (3-5x/semana)

# intense
source: Intense (6-7x/week)
pt: Intenso (6-7x/semana)

# extreme
source: Extreme (2x/day)
pt: Extremo (2x/dia)

source: Hydration goal
pt: Meta de hidratação

source: Personalized goal (recommended)
pt: Meta personalizada (recomendado)

# perDay
source: {amount}ml per day
pt: {amount}ml por dia

source: Set goal manually
pt: Definir meta manualmente

source: Goal (ml)
pt: Meta (ml)

# recommendedRange
source: Recommended: 1500ml - 3000ml
pt: Recomendado: 1500ml - 3000ml

source: Hydration reminders
pt: Lembretes de hidratação

# receiveSmartReminders
source: Receive smart reminders to drink water throughout the day
pt: Receba lembretes inteligentes para beber água ao longo do dia

# customizeSchedule
source: You can customize schedules and intervals in settings.
pt: Você poderá personalizar os horários e intervalos nas configurações.

source: Not now
pt: Agora não

source: Allow Notifications
pt: Permitir Notificações

source: Back
pt: Voltar

source: Next
pt: Próximo

source: Finish
pt: Finalizar

source: Settings
pt: Configurações

source: Daily Goal
pt: Meta Diária

source: Volume Unit
pt: Unidade de Volume

source: Dark Mode
pt: Modo Escuro

source: Enabled
pt: Ativado

source: Disabled
pt: Desativado

source: Notifications
pt: Notificações

source: About
pt: Sobre

# aboutH2OSimple
source: About H2OSync
pt: Sobre o H2OSync

source: Version
pt: Versão

source: Data
pt: Dados

source: Reset Data
pt: Resetar Dados

source: Delete all saved data
pt: Apagar todos os dados salvos

source: Select Unit
pt: Selecionar Unidade

source: Milliliters
pt: Mililitros

source: Fluid Ounces
pt: Onças Fluidas

source: Symbol
pt: Símbolo

source: Cancel
pt: Cancelar

# unitChangedTo
source: Unit changed to {unit}
pt: Unidade alterada para {unit}

source: Change Daily Goal
pt: Alterar Meta Diária

# recommendedDaily
source: Recommended: 2000ml - 2500ml per day
pt: Recomendado: 2000ml - 2500ml por dia

source: Save
pt: Salvar

# goalChangedTo
source: Goal changed to {amount}ml
pt: Meta alterada para {amount}ml

source: Confirm Reset Data
pt: Resetar Dados

# resetWarningMessage
source: Are you sure you want to reset all data? This action cannot be undone.
pt: Tem certeza que deseja resetar todos os dados? Esta ação não pode ser desfeita.

source: Reset
pt: Resetar

source: Data reset successfully
pt: Dados resetados com sucesso

source: Custom Amount
pt: Quantidade Personalizada

# enterValidAmount
source: Enter a valid amount
pt: Digite uma quantidade válida

# enterValueBetween
source: Enter a value between 1 and 9999 ml
pt: Digite um valor entre 1 e 9999 ml

source: Add
pt: Adicionar

source: 🎉 Congratulations!
pt: 🎉 Parabéns!

# goalAchievedMessage
source: You reached your daily hydration goal!\n\nYour body thanks you! 💧
pt: Você alcançou sua meta de hidratação diária!\n\nSeu corpo agradece! 💧

# continueText
source: Continue
pt: Continuar

# prepositionOf
source: of
pt: de

# remaining
source: Remaining {amount}ml
pt: Faltam {amount}ml

source: Custom
pt: Personalizado

source: History
pt: Histórico

source: Daily
pt: Diário

source: Notification Settings
pt: Configurações de Notificação

source: Interval between notifications:
pt: Intervalo entre notificações:

source: Every hour
pt: A cada hora

# everyXHours
source: Every {hours} hours
pt: A cada {hours} horas

source: Start time:
pt: Horário de início:

source: End time:
pt: Horário de fim:

source: Send Test Notification
pt: Enviar Notificação de Teste

source: Close
pt: Fechar

source: Average per record:
pt: Média por registro:

# h2oSimpleDescription
source: App to track your daily water consumption and maintain healthy hydration.
pt: App para acompanhar seu consumo diário de água e manter uma hidratação saudável.

source: Developed with Flutter 💙
pt: Desenvolvido com Flutter 💙

source: Select Language
pt: Selecionar Idioma

# languageChanged
source: Language changed successfully
pt: Idioma alterado com sucesso

# resetDataConfirmation
source: Are you sure you want to reset all data? This action cannot be undone.
pt: Tem certeza que deseja resetar todos os dados? Esta ação não pode ser desfeita.

# loading
source: Loading H2OSync...
pt: Carregando H2OSync...

source: Water reminders
pt: Lembretes para beber água

source: Notification permission denied
pt: Permissão para notificações negada

# aboutApp
source: About the App
pt: Sobre o App

# appInfo
source: Information and credits
pt: Informações e créditos

source: Reset All Data
pt: Resetar Dados

# lightActivity
source: Light (1-3x/week)
pt: Leve (1-3x/semana)

# moderateActivity
source: Moderate (3-5x/week)
pt: Moderado (3-5x/semana)

# intenseActivity
source: Intense (6-7x/week)
pt: Intenso (6-7x/semana)

# extremeActivity
source: Extreme (2x/day)
pt: Extremo (2x/dia)

source: Custom goal (recommended)
pt: Meta personalizada (recomendado)

# mlPerDay
source: {amount}ml per day
pt: {amount}ml por dia

source: Try again
pt: Tentar novamente

# errorLoadingData
source: Error loading data: {error}
pt: Erro ao carregar dados: {error}

# welcomeToH2O
source: Welcome to H2OSync!
pt: Bem-vindo ao H2OSync!

# noRecordsThisDay
source: No records on this day
pt: Nenhum registro neste dia

# dataResetSuccess
source: Data reset successfully
pt: Dados resetados com sucesso

# invalidAmount
source: Please enter a valid amount
pt: Por favor, insira uma quantidade válida

# amountTooSmall
source: Amount must be greater than 0ml
pt: A quantidade deve ser maior que 0ml

# notificationsEnabled
source: Notifications enabled successfully
pt: Notificações ativadas com sucesso

# notificationsNotAvailable
source: Notifications are not available on this device
pt: Notificações não estão disponíveis neste dispositivo

source: Error enabling notifications
pt: Erro ao ativar notificações

# setupCompleteWithGoal
source: ✅ Setup complete! Goal: {goal}ml/day
pt: ✅ Configuração concluída! Meta: {goal}ml/dia

# setupCompleteManual
source: ⚙️ Setup complete! Goal: {goal}ml/day
pt: ⚙️ Configuração concluída! Meta: {goal}ml/dia

# errorSavingSettings
source: Error saving settings: {error}
pt: Erro ao salvar configurações: {error}

# confirmDelete
source: Do you really want to delete {itemName}?
pt: Deseja realmente excluir {itemName}?

source: Error loading hydration data
pt: Erro ao carregar dados de hidratação

source: Error adding water intake
pt: Erro ao adicionar consumo de água

source: Error removing water intake
pt: Erro ao remover consumo de água

source: Error checking notifications
pt: Erro ao verificar notificações

source: Confirm deletion
pt: Confirmar exclusão

source: Delete
pt: Excluir

source: Confirm reset
pt: Confirmar reset

# resetConfirmMessage
source: This action will permanently delete all data. Do you want to continue?
pt: Esta ação irá apagar permanentemente todos os dados. Deseja continuar?

source: Today
pt: Hoje

source: Day
pt: Dia

source: Week
pt: Semana

source: Month
pt: Mês

source: 🎉 Goal achieved!
pt: 🎉 Meta atingida!

# goalCompleted
source: 🎉 Goal Achieved!
pt: 🎉 Meta Alcançada!

# goalCompletedMessage
source: Congratulations! You reached your daily goal of {amount}ml. Keep up the excellent hydration!
pt: Parabéns! Você atingiu sua meta diária. Continue mantendo essa excelente hidratação!

# weeklyAchievement
source: 🗓️ Weekly Success!
pt: 🗓️ Sucesso Semanal!

# weeklyAchievementMessage
source: Amazing! You completed your hydration goal {days} days this week. You're building a healthy habit!
pt: Incrível! Você completou sua meta de hidratação {days} dias esta semana. Você está criando um hábito saudável!

source: 🔥 Streak Milestone!
pt: 🔥 Marco de Sequência!

# streakMilestoneMessage
source: Incredible! You've maintained your hydration streak for {days} consecutive days. You're a hydration champion!
pt: Incrível! Você manteve sua sequência de hidratação por {days} dias consecutivos. Você é um campeão da hidratação!

# adLabel
source: Ad
pt: Anúncio

source: Smart Hydration Bottle
pt: Garrafa Inteligente HydroTech

source: Hydration+ Supplements
pt: Suplementos Hidratação+

# premiumFitWaterApp
source: FitWater Premium App
pt: App Premium FitWater

source: Hydration Products
pt: Produtos para Hidratação

# monitorAutomatically
source: Monitor automatically without effort
pt: Monitore automaticamente sem esforço

# naturalElectrolytes
source: Natural electrolytes for all day
pt: Eletrólitos naturais para o dia todo

# advancedFeaturesNoAds
source: Advanced features without ads
pt: Recursos avançados sem anúncios

# improveDailyHydration
source: Improve your daily hydration
pt: Melhore sua hidratação diária

source: Total consumed:
pt: Total consumido:

# todayHydration
source: Today's hydration
pt: Hidratação de hoje

# ofTarget
source: of {target}ml
pt: de {target}ml

source: Confirm
pt: Confirmar

source: Amount (ml)
pt: Quantidade (ml)

# customizeNotificationSettings
source: You can customize the times and intervals in the settings.
pt: Você poderá personalizar os horários e intervalos nas configurações.

# welcomeToH2OSimple
source: Welcome to H2OSync!
pt: Bem-vindo ao H2OSync!

# letsCustomizeExperience
source: Let's customize your experience!
pt: Vamos personalizar sua experiência!

# helpMaintainHealthyHydration
source: To help you maintain healthy hydration, we'll set up:
pt: Para ajudá-lo a manter uma hidratação saudável, vamos configurar:

# basedOnWeightAgeActivity
source: Based on your weight, age and activity level
pt: Baseada em seu peso, idade e nível de atividade

source: Intelligent reminders
pt: Lembretes inteligentes

# ageYears
source: Age
pt: Idade

# receiveIntelligentReminders
source: Receive intelligent reminders to drink water throughout the day
pt: Receba lembretes inteligentes para beber água ao longo do dia

# goalMlLabel
source: Goal (ml)
pt: Meta (ml)

# recommendedDailyGoal
source: Recommended: 2000ml - 2500ml per day
pt: Recomendado: 2000ml - 2500ml por dia

# adultRecommendation
source: The recommended goal for adults is 2-3 liters per day.
pt: A meta recomendada para adultos é de 2-3 litros por dia.

# confirmDeleteWaterRecord
source: Do you really want to delete this water intake record?
pt: Deseja realmente excluir este registro de consumo de água?

# testNotificationTitle
source: H2OSync - Test
pt: H2OSync - Teste

# testNotificationBody
source: 💧 This is a test notification! Your notifications are working.
pt: 💧 Esta é uma notificação de teste! Suas notificações estão funcionando.

# everyHourInterval
source: Every hour
pt: A cada hora

# everyXHoursInterval
source: Every {hours} hours
pt: A cada {hours} horas

# fromToSchedule
source: From {startTime} to {endTime}
pt: Das {startTime} às {endTime}

source: Yesterday
pt: Ontem

# monShort
source: Mon
pt: Seg

# tueShort
source: Tue
pt: Ter

# wedShort
source: Wed
pt: Qua

# thuShort
source: Thu
pt: Qui

# friShort
source: Fri
pt: Sex

# satShort
source: Sat
pt: Sáb

# sunShort
source: Sun
pt: Dom

source: Daily Consumption
pt: Consumo do Dia

source: Weekly Consumption
pt: Consumo Semanal

source: Monthly Consumption
pt: Consumo Mensal

# weekLabel
source: Week
pt: Semana

# daysLabel
source: Days
pt: Dias

source: Remove Ads
pt: Remover Anúncios

source: Premium Features
pt: Recursos Premium

# removeAdsDescription
source: Remove all ads for a smoother experience
pt: Remova todos os anúncios para uma experiência mais fluida

source: Purchase - Remove Ads
pt: Comprar - Remover Anúncios

# removeAdsForever
source: Remove all ads permanently for just:
pt: Remova todos os anúncios permanentemente por apenas:

source: Buy Now
pt: Comprar Agora

source: Restore Purchases
pt: Restaurar Compras

# purchaseSuccess
source: Purchase successful! Ads have been removed.
pt: Compra realizada com sucesso! Os anúncios foram removidos.

# purchaseError
source: Error processing purchase. Please try again.
pt: Erro ao processar a compra. Tente novamente.

# restoreSuccess
source: Purchases restored successfully!
pt: Compras restauradas com sucesso!

# restoreError
source: No purchases found to restore.
pt: Nenhuma compra encontrada para restaurar.

# purchaseNotAvailable
source: Purchases not available at the moment.
pt: Compras não disponíveis no momento.

source: Premium User
pt: Usuário Premium

# thanksForSupport
source: Thank you for your support! 💙
pt: Obrigado pelo seu apoio! 💙
